<a href="https://colab.research.google.com/github/daanishrasheed/WeatherForecasting/blob/main/analysis.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [9]:
import numpy as np
import pandas as pd
import plotly.express as px 
import plotly.graph_objects as go
from plotly.subplots import make_subplots
from datetime import datetime

In [10]:
df = pd.read_csv("Weather.csv", index_col = 0)

In [11]:
df.head()

   YEAR    JAN    FEB    MAR    APR  ...    AUG    SEP    OCT    NOV    DEC
0  1901  17.99  19.43  23.49  26.41  ...  26.98  26.26  25.08  21.73  18.95
1  1902  19.00  20.39  24.10  26.54  ...  27.05  25.95  24.37  21.33  18.78
2  1903  18.32  19.79  22.46  26.03  ...  26.63  26.34  24.57  20.96  18.29
3  1904  17.77  19.39  22.95  26.73  ...  26.73  25.84  24.36  21.07  18.84
4  1905  17.40  17.79  21.78  24.84  ...  27.47  26.29  26.16  22.07  18.71

[5 rows x 13 columns]

In its current state, this dataframe is difficult to perform analysis on. We will try to rearrange the columns and rows to a more reliable form.

In [12]:
df1 = pd.melt(df, id_vars='YEAR', value_vars=df.columns[1:])
df1.head()

   YEAR variable  value
0  1901      JAN  17.99
1  1902      JAN  19.00
2  1903      JAN  18.32
3  1904      JAN  17.77
4  1905      JAN  17.40

In [13]:
df1['Date'] = df1['variable'] + ' ' + df1['YEAR'].astype(str)
df1.loc[:, 'Date'] = df1['Date'].apply(lambda x: datetime.strptime(x, '%b %Y'))
df1.head()

   YEAR variable  value       Date
0  1901      JAN  17.99 1901-01-01
1  1902      JAN  19.00 1902-01-01
2  1903      JAN  18.32 1903-01-01
3  1904      JAN  17.77 1904-01-01
4  1905      JAN  17.40 1905-01-01

In [14]:
df1.columns=['Year', 'Month', 'Temperature', 'Date']
df1.head()

   Year Month  Temperature       Date
0  1901   JAN        17.99 1901-01-01
1  1902   JAN        19.00 1902-01-01
2  1903   JAN        18.32 1903-01-01
3  1904   JAN        17.77 1904-01-01
4  1905   JAN        17.40 1905-01-01

In [15]:
df1.sort_values(by = 'Date', inplace=True)
df1.head()

     Year Month  Temperature       Date
0    1901   JAN        17.99 1901-01-01
117  1901   FEB        19.43 1901-02-01
234  1901   MAR        23.49 1901-03-01
351  1901   APR        26.41 1901-04-01
468  1901   MAY        28.28 1901-05-01